# Classification Exercises

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### 1. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

#### print the first 3 rows

In [5]:
iris_df  = sns.load_dataset('iris')

iris_df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

#### print the number of rows and columns (shape)

In [6]:
iris_df.shape

(150, 5)

#### print the column names

In [7]:
iris_df.nunique()

sepal_length    35
sepal_width     23
petal_length    43
petal_width     22
species          3
dtype: int64

#### print the data type of each column

In [14]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

#### print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [15]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [18]:
telco_df = pd.read_excel('Spreadsheets_Exercises_Jeff.xlsx')
telco_df.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,NaN,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,NaN,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,NaN,NaN
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,NaN,NaN
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,NaN,NaN

#### assign the first 100 rows to a new dataframe, df_excel_sample

In [21]:
telco_df_sample = telco_df.iloc[0:100]
telco_df_sample.shape

(100, 14)

#### print the number of rows of your original dataframe

In [22]:
telco_df.shape

(7049, 14)

#### print the first 5 column names

In [25]:
telco_df.nunique()

customer_id          7043
gender                  2
is_senior_citizen       2
partner                 2
dependents              2
phone_service           3
internet_service        3
contract_type           3
payment_type            4
monthly_charges      1585
total_charges        6530
churn                   2
Unnamed: 12             0
Unnamed: 13             0
dtype: int64

#### print the column names that have a data type of object

In [30]:
telco_df.dtypes[telco_df.dtypes == 'object']

customer_id     object
gender          object
partner         object
dependents      object
payment_type    object
churn           object
dtype: object

#### compute the range for each of the numeric variables.

In [32]:
telco_df.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,Unnamed: 12,Unnamed: 13
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000,0.0,0.0
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883,NaN,NaN
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984,NaN,NaN
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000,NaN,NaN
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500,NaN,NaN
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000,NaN,NaN
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000,NaN,NaN
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000,NaN,NaN

In [33]:
def range(max, min):
    max = max()
    return max - min

AttributeError: 'DataFrame' object has no attribute 'RangeIndex'

### 3. Read the data from this google sheet into a dataframe, df_google

#### print the first 3 rows

#### print the number of rows and columns

#### print the column names

#### print the data type of each column

#### print the summary statistics for each of the numeric variables

#### print the unique values for each of your categorical variables